benchmarks/03.06.2017.m3.2xl.3.uniform.0/20/ycsb-results
java -cp bin/postgresql-9.4.1212.jre7.jar:/home/ubuntu/tanuj/jdbc-binding/conf:/home/ubuntu/tanuj/conf:/home/ubuntu/tanuj/lib/openjpa-jdbc-2.1.1.jar:/home/ubuntu/tanuj/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/tanuj/lib/geronimo-jta_1.1_spec-1.1.1.jar:/home/ubuntu/tanuj/lib/commons-collections-3.2.1.jar:/home/ubuntu/tanuj/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/tanuj/lib/geronimo-jms_1.1_spec-1.1.1.jar:/home/ubuntu/tanuj/lib/serp-1.13.1.jar:/home/ubuntu/tanuj/lib/openjpa-kernel-2.1.1.jar:/home/ubuntu/tanuj/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/tanuj/lib/core-0.12.0.jar:/home/ubuntu/tanuj/lib/jdbc-binding-0.12.0.jar:/home/ubuntu/tanuj/lib/openjpa-lib-2.1.1.jar:/home/ubuntu/tanuj/lib/commons-lang-2.4.jar:/home/ubuntu/tanuj/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/tanuj/lib/commons-pool-1.5.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.JdbcDBClient -P workloads/uniform -P cockroachdb.properties -p db.url=jdbc:postgresql://52.35.83.34:26267/test,jdbc:postgresql://35.164.181.132:26267/test,jdbc:postgresql://52.34.243.225:26267/test,jdbc:postgresql://35.167.142.209:26267/test,jdbc:postgresql://35.165.166.141:26267/test -s -threads 20 -t
YCSB Client 0.12.0
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P workloads/uniform -P cockroachdb.properties -p db.url=jdbc:postgresql://52.35.83.34:26267/test,jdbc:postgresql://35.164.181.132:26267/test,jdbc:postgresql://52.34.243.225:26267/test,jdbc:postgresql://35.167.142.209:26267/test,jdbc:postgresql://35.165.166.141:26267/test -s -threads 20 -t
Loading workload...
Starting test.
2017-03-06 07:47:17:734 0 sec: 0 operations; est completion in 0 seconds 
Adding shard node URL: jdbc:postgresql://52.35.83.34:26267/test
Adding shard node URL: jdbc:postgresql://52.35.83.34:26267/test
Adding shard node URL: jdbc:postgresql://52.35.83.34:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.164.181.132:26267/test
Adding shard node URL: jdbc:postgresql://35.164.181.132:26267/test
Adding shard node URL: jdbc:postgresql://35.164.181.132:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.164.181.132:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://52.34.243.225:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
[...]
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.167.142.209:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test

Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Adding shard node URL: jdbc:postgresql://35.165.166.141:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2017-03-06 07:47:27:706 10 sec: 85929 operations; 8592.9 current ops/sec; est completion in 2 seconds [READ: Count=81641, Max=25583, Min=833, Avg=2127.39, 90=3149, 99=7791, 99.9=15047, 99.99=24511] [UPDATE: Count=4309, Max=37759, Min=2058, Avg=5300.01, 90=8207, 99=15775, 99.9=22079, 99.99=37759] 
2017-03-06 07:47:29:480 11 sec: 100000 operations; 7927.32 current ops/sec; [READ: Count=13323, Max=26687, Min=851, Avg=2143.73, 90=3171, 99=8223, 99.9=25743, 99.99=26351] [CLEANUP: Count=20, Max=381, Min=117, Avg=151.5, 90=165, 99=381, 99.9=381, 99.99=381] [UPDATE: Count=727, Max=25471, Min=2136, Avg=5370.08, 90=8151, 99=20031, 99.9=25375, 99.99=25471] 
[OVERALL], RunTime(ms), 11775.0
[OVERALL], Throughput(ops/sec), 8492.569002123142
[TOTAL_GCS_PS_Scavenge], Count, 1.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 6.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.05095541401273885
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1.0
[TOTAL_GC_TIME], Time(ms), 6.0
[TOTAL_GC_TIME_%], Time(%), 0.05095541401273885
[READ], Operations, 94964.0
[READ], AverageLatency(us), 2129.680752706289
[READ], MinLatency(us), 833.0
[READ], MaxLatency(us), 26687.0
[READ], 95thPercentileLatency(us), 5039.0
[READ], 99thPercentileLatency(us), 7867.0
[READ], Return=OK, 94964
[CLEANUP], Operations, 20.0
[CLEANUP], AverageLatency(us), 151.5
[CLEANUP], MinLatency(us), 117.0
[CLEANUP], MaxLatency(us), 381.0
[CLEANUP], 95thPercentileLatency(us), 267.0
[CLEANUP], 99thPercentileLatency(us), 381.0
[UPDATE], Operations, 5036.0
[UPDATE], AverageLatency(us), 5310.123510722796
[UPDATE], MinLatency(us), 2058.0
[UPDATE], MaxLatency(us), 37759.0
[UPDATE], 95thPercentileLatency(us), 10735.0
[UPDATE], 99thPercentileLatency(us), 16399.0
[UPDATE], Return=OK, 5036